In [1]:
import pandas as pd

In [1]:
# average ,total

import pandas as pd
df= pd.read_csv("student_marks.csv")
df["average_marks"]=df.select_dtypes(include=["int"]).mean(axis=1)
df
df["Total marks"]=df.select_dtypes(include=["int"]).sum(axis=1)
df

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,average_marks,Total marks
0,John,M,05-04-1988,55,45,56,87,21,52,89,65,58.750,470
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2,65.500,524
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74,69.500,556
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45,73.250,586
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53,73.375,587
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52,69.500,556
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61,62.000,496
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87,64.625,517
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89,73.375,587
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77,70.750,566